"""
练习3 ： 在一个文件  my.log 中不间断的写入内容

        1. 2020-01-01 10:10:10
        2. 2020-01-01 10:10:12
        3. 2020-01-01 10:10:14
        4. 2020-01-01 10:10:16
        5. 2020-01-01 10:28:40
        6. 2020-01-01 10:28:42
        7. 2020-01-01 10:28:44


        要求： 每隔2秒写入一行 sleep(2)
              写入的内容要实时能够查看
              当程序终止后，如果重新启动程序会继续写入，并且序号可以衔接
"""
from time import sleep,ctime

f = open('my.log','a+',buffering=1) # 行缓冲

# 设置n初始值 --》 行数 + 1
f.seek(0,0) # 文件偏移量在开头
n = 1
for i in f:
    n += 1

while True:
    sleep(2) # 暂停2s
    data = "%d. %s\n"%(n,ctime())
    f.write(data)
    n += 1 # 行号增加

f.close()
